
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_project.project: Reading...
google_service_account.cloud_run_sa: Refreshing state... [id=projects/rising-sector-360922/serviceAccounts/gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_pubsub_topic.label_topics["Council Data Sales"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_sales]
google_pubsub_topic.label_topics["Council Data DVR"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_dvr]
google_project_iam_member.datastore_user: Refreshing state... [id=rising-sector-360922/roles/datastore.user/serviceAccount:gmail-watcher@rising-sector-360922.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.gmail_member["Council Data DVR"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_dvr/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com]
google_pubsub_topic_iam_member.gmail_member["Council Data Sales"]: Refreshing state... [id=projects/rising-sector-360922/topics/council_data_sales/roles/pubsub.publisher/serviceAccount:gmail-api-push@system.gserviceaccount.com]
google_cloud_run_v2_job.gmail_watcher: Refreshing state... [id=projects/rising-sector-360922/locations/us-central1/jobs/gmail-watcher]
data.google_project.project: Read complete after 1s [id=projects/rising-sector-360922]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_job_iam_member.cloud_run_invoker_member will be created
  + resource "google_cloud_run_v2_job_iam_member" "cloud_run_invoker_member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = (known after apply)
      + name     = "gmail-watcher"
      + project  = "rising-sector-360922"
      + role     = "roles/run.invoker"
    }

  # google_cloud_scheduler_job.trigger_job will be created
  + resource "google_cloud_scheduler_job" "trigger_job" {
      + attempt_deadline = "320s"
      + id               = (known after apply)
      + name             = "schedule-gmail-watcher"
      + paused           = (known after apply)
      + project          = "rising-sector-360922"
      + region           = "us-central1"
      + schedule         = "0 0 */6 * *"
      + state            = (known after apply)
      + time_zone        = "Etc/UTC"

      + http_target {
          + http_method = "POST"
          + uri         = "https://us-central1-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/950322501036/jobs/gmail-watcher:run"

          + oauth_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # google_service_account.cloud_run_scheduler will be created
  + resource "google_service_account" "cloud_run_scheduler" {
      + account_id = "scheduler"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = "rising-sector-360922"
      + unique_id  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Wallace99, Action: `pull_request`, Working Directory: `./terraform`, Workflow: `Deploy`*